yaswanth8872y/AURIX_code_examples/code_examples/iLLD_TC4D7_LK_ADS_QSPI_TLE9180D_2/Qspi.h
/**********************************************************************************************************************
 * \file    Qspi.h
 * \copyright Copyright (C) Infineon Technologies AG 2023
 *
 * Use of this file is subject to the terms of use agreed between (i) you or the company in which ordinary course of
 * business you are acting and (ii) Infineon Technologies AG or its licensees. If and as long as no such terms of use
 * are agreed, use of this file is subject to following:
 *
 * Boost Software License - Version 1.0 - August 17th, 2003
 *
 * Permission is hereby granted, free of charge, to any person or organization obtaining a copy of the software and
 * accompanying documentation covered by this license (the "Software") to use, reproduce, display, distribute, execute,
 * and transmit the Software, and to prepare derivative works of the Software, and to permit third-parties to whom the
 * Software is furnished to do so, all subject to the following:
 *
 * The copyright notices in the Software and this entire statement, including the above license grant, this restriction
 * and the following disclaimer, must be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are solely in the form of
 * machine-executable object code generated by a source language processor.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE
 * WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT SHALL THE
 * COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN
 * CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * IN THE SOFTWARE.
 *********************************************************************************************************************/

#ifndef QSPI_H_
#define QSPI_H_

/*********************************************************************************************************************/
/*-----------------------------------------------------Includes------------------------------------------------------*/
/*********************************************************************************************************************/
#include "IfxQspi_SpiMaster.h"
#include "IfxDma.h"
#include "TLE9180.h"
#include "IfxPort_PinMap.h"

/*********************************************************************************************************************/
/*------------------------------------------------------Macros-------------------------------------------------------*/
/*********************************************************************************************************************/
/* Define the QSPI0 transmit interrupt priority. */
#define INTERRUPT_PRIORITY_QSPI3_TX      (40)
/* Define the QSPI0 receive interrupt priority. */
#define INTERRUPT_PRIORITY_QSPI3_RX      (41)
/* Define the QSPI0 error interrupt priority. */
#define INTERRUPT_PRIORITY_QSPI3_ERR     (42)
/* Define the TLE9180 Enable Pin GPIO.  */
#define TLE9180_ENABLE_PIN               &IfxPort_P16_10
/* Define the TLE9180 Error Pin GPIO.  */
#define TLE9180_ERROR_PIN                &IfxPort_P16_12
/* Define the TLE9180 Inhibit Pin GPIO.  */
#define TLE9180_INHIBIT_PIN              &IfxPort_P16_9
/* Define the TLE9180 Safe Off Pin GPIO.  */
#define TLE9180_SAFEOFF_PIN              &IfxPort_P16_11
/* TLE9180 QSPI define */
/* Define the QSPI slave select pin. */
#define TLE9180_SPI_CS_PIN              IfxQspi4_SLSO3_P22_2_OUT
/* Define the QSPI object */
#define TLE9180_SPI_MODULE              MODULE_QSPI4
/* Define the QSPI SLCK out pin */
#define TLE9180_SPI_CLOCK_PIN           IfxQspi4_SCLK_F_P22_3_OUT
/* Define the QSPI MTSR out pin */
#define TLE9180_SPI_MOSI_PIN            IfxQspi4_MTSR_F_P22_0_OUT
/* Define the QSPI MRSTA input pin */
#define TLE9180_SPI_MISO_PIN            IfxQspi4_MRSTB_F_P22_1_IN
/* Define the handler of the interrupts*/
#define TLE9180_SPI_HOST_CPU            IfxSrc_Tos_cpu0
/* Define the use of DMA for Data transfer/s */
#define TLE9180_SPI_USE_DMA             FALSE
/* Define the DMA channel no for the QSPI transmit */
#define TLE9180_SPI_TX_DMA_CH           IfxDma_ChannelId_none
/* Define the DMA channel no for the QSPI receive */
#define TLE9180_SPI_RX_DMA_CH           IfxDma_ChannelId_none

/* Assign TLE9180 defines to QSPI3 */
#define SPI_3_MODULE                    TLE9180_SPI_MODULE
#define SPI_3_CLOCK_PIN                 TLE9180_SPI_CLOCK_PIN
#define SPI_3_MOSI_PIN                  TLE9180_SPI_MOSI_PIN
#define SPI_3_MISO_PIN                  TLE9180_SPI_MISO_PIN
#define SPI_3_HOST_CPU                  TLE9180_SPI_HOST_CPU
#define SPI_3_CS_PIN                    TLE9180_SPI_CS_PIN
#define SPI_3_USE_DMA                   TLE9180_SPI_USE_DMA
#define SPI_3_TX_DMA_CH                 TLE9180_SPI_TX_DMA_CH
#define SPI_3_RX_DMA_CH                 TLE9180_SPI_RX_DMA_CH

/*********************************************************************************************************************/
/*-------------------------------------------------Global variables--------------------------------------------------*/
/*********************************************************************************************************************/

/*********************************************************************************************************************/
/*-------------------------------------------------Data Structures---------------------------------------------------*/
/*********************************************************************************************************************/
 /* Structure for QSPI communication configuration and handling
 */
typedef struct
{
    IfxQspi_SpiMaster           spiMasterQspi3tle9180;
    IfxQspi_SpiMaster_Channel   spiChannelQspi3tle9180;
    IfxTLE9180                  driverTle9180;
} QspiCommunication;

/*********************************************************************************************************************/
/*--------------------------------------------Private Variables/Constants--------------------------------------------*/
/*********************************************************************************************************************/

/*********************************************************************************************************************/
/*------------------------------------------------Function Prototypes------------------------------------------------*/
/*********************************************************************************************************************/

/*
 *
 *  inverter Reference to structure that contains instance data members
 *
 * /note
 * /see
 * /ingroup
 */
IFX_EXTERN void Qspi_initQspi(QspiCommunication* const qspiCommunication);

#endif /* QSPI_H_ */
